<a href="https://colab.research.google.com/github/lovelyoyrmia/machine-learning-notebook/blob/main/olympics_analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
from google.colab import files

In [ ]:
df = pd.read_csv('/content/athlete_events.csv',error_bad_lines=False, engine='python')
regions_df = pd.read_csv('/content/noc_regions.csv')

Skipping line 144155: unexpected end of data

In [ ]:
df.head(2)

   ID       Name Sex  ...       Sport                         Event Medal
0   1  A Dijiang   M  ...  Basketball   Basketball Men's Basketball   NaN
1   2   A Lamusi   M  ...        Judo  Judo Men's Extra-Lightweight   NaN

[2 rows x 15 columns]

In [ ]:
df.tail()

           ID              Name  ...                                     Event  Medal
144148  69020      Karel Letina  ...  Canoeing Men's Kayak Doubles, 500 metres    NaN
144149  69020      Karel Letina  ...  Canoeing Men's Kayak Fours, 1,000 metres    NaN
144150  69020      Karel Letina  ...  Canoeing Men's Kayak Fours, 1,000 metres    NaN
144151  69021  Damiano Lestingi  ...      Swimming Men's 100 metres Backstroke    NaN
144152  69021  Damiano Lestingi  ...      Swimming Men's 200 metres Backstroke    NaN

[5 rows x 15 columns]

In [ ]:
df.shape

(144153, 15)

In [ ]:
df[df['Season'] == 'Summer']

           ID  ... Medal
0           1  ...   NaN
1           2  ...   NaN
2           3  ...   NaN
3           4  ...  Gold
26          8  ...   NaN
...       ...  ...   ...
144148  69020  ...   NaN
144149  69020  ...   NaN
144150  69020  ...   NaN
144151  69021  ...   NaN
144152  69021  ...   NaN

[118130 rows x 15 columns]

In [ ]:
df = df[df['Season'] == 'Summer']

In [ ]:
df.shape

(118130, 15)

In [ ]:
df.tail()

           ID              Name  ...                                     Event  Medal
144148  69020      Karel Letina  ...  Canoeing Men's Kayak Doubles, 500 metres    NaN
144149  69020      Karel Letina  ...  Canoeing Men's Kayak Fours, 1,000 metres    NaN
144150  69020      Karel Letina  ...  Canoeing Men's Kayak Fours, 1,000 metres    NaN
144151  69021  Damiano Lestingi  ...      Swimming Men's 100 metres Backstroke    NaN
144152  69021  Damiano Lestingi  ...      Swimming Men's 200 metres Backstroke    NaN

[5 rows x 15 columns]

In [ ]:
regions_df.tail()

     NOC    region        notes
225  YEM     Yemen          NaN
226  YMD     Yemen  South Yemen
227  YUG    Serbia   Yugoslavia
228  ZAM    Zambia          NaN
229  ZIM  Zimbabwe          NaN

In [ ]:
df = df.merge(regions_df, how='left', on='NOC')

In [ ]:
df.tail()

           ID              Name Sex  ...  Medal          region notes
118125  69020      Karel Letina   M  ...    NaN  Czech Republic   NaN
118126  69020      Karel Letina   M  ...    NaN  Czech Republic   NaN
118127  69020      Karel Letina   M  ...    NaN  Czech Republic   NaN
118128  69021  Damiano Lestingi   M  ...    NaN           Italy   NaN
118129  69021  Damiano Lestingi   M  ...    NaN           Italy   NaN

[5 rows x 17 columns]

In [ ]:
df['region'].unique()

array(['China', 'Denmark', 'Netherlands', 'Finland', 'Norway', 'Romania',
       'Estonia', 'France', 'Morocco', 'Spain', 'Egypt', 'Iran',
       'Bulgaria', 'Italy', 'Chad', 'Azerbaijan', 'Sudan', 'Russia',
       'Argentina', 'Cuba', 'Belarus', 'Greece', 'Cameroon', 'Turkey',
       'Chile', 'Mexico', 'USA', 'Nicaragua', 'Hungary', 'Nigeria',
       'Algeria', 'Kuwait', 'Bahrain', 'Pakistan', 'Iraq', 'Syria',
       'Lebanon', 'Qatar', 'Malaysia', 'Germany', 'Canada', 'Ireland',
       'Australia', 'South Africa', 'Eritrea', 'Tanzania', 'Jordan',
       'Tunisia', 'Libya', 'Belgium', 'Djibouti', 'Palestine', 'Comoros',
       'Kazakhstan', 'Brunei', 'India', 'Saudi Arabia', 'Maldives',
       'Ethiopia', 'United Arab Emirates', 'Yemen', 'Indonesia',
       'Philippines', nan, 'Uzbekistan', 'Kyrgyzstan', 'Tajikistan',
       'Japan', 'Republic of Congo', 'Switzerland', 'Brazil', 'Monaco',
       'Israel', 'Uruguay', 'Sweden', 'Sri Lanka', 'Armenia',
       'Ivory Coast', 'Kenya', 'Benin', 'UK', 'Ghana', 'Somalia', 'Niger',
       'Mali', 'Afghanistan', 'Poland', 'Costa Rica', 'Panama', 'Georgia',
       'Slovenia', 'Guyana', 'New Zealand', 'Portugal', 'Paraguay',
       'Angola', 'Venezuela', 'Colombia', 'Bangladesh', 'Peru',
       'El Salvador', 'Puerto Rico', 'Uganda', 'Honduras', 'Ecuador',
       'Turkmenistan', 'Mauritius', 'Seychelles', 'Czech Republic',
       'Luxembourg', 'Mauritania', 'Saint Kitts', 'Trinidad',
       'Dominican Republic', 'Saint Vincent', 'Jamaica', 'Liberia',
       'Suriname', 'Nepal', 'Mongolia', 'Austria', 'Palau', 'Lithuania',
       'Togo', 'Namibia', 'Curacao', 'Ukraine', 'Iceland',
       'American Samoa', 'Samoa', 'Rwanda', 'Croatia', 'Dominica',
       'Haiti', 'Malta', 'Cyprus', 'Guinea', 'Belize', 'Thailand',
       'Bermuda', 'Serbia', 'Sierra Leone', 'Papua New Guinea',
       'Individual Olympic Athletes', 'Oman', 'Fiji', 'Vanuatu',
       'Moldova', 'Bahamas', 'Guatemala', 'Latvia',
       'Virgin Islands, British', 'Mozambique', 'Virgin Islands, US',
       'Central African Republic', 'Madagascar', 'Bosnia and Herzegovina',
       'Guam', 'Cayman Islands', 'Slovakia', 'Barbados', 'Guinea-Bissau',
       'Timor-Leste', 'Democratic Republic of the Congo', 'Gabon',
       'San Marino', 'Laos', 'Botswana', 'South Korea', 'Cambodia',
       'North Korea', 'Solomon Islands', 'Senegal', 'Cape Verde',
       'Equatorial Guinea', 'Boliva', 'Antigua', 'Andorra', 'Zimbabwe',
       'Grenada', 'Saint Lucia', 'Micronesia', 'Myanmar', 'Malawi',
       'Zambia', 'Taiwan', 'Sao Tome and Principe', 'Macedonia',
       'Liechtenstein', 'Montenegro', 'Gambia', 'Cook Islands', 'Albania',
       'Swaziland', 'Burkina Faso', 'Burundi', 'Aruba', 'Nauru',
       'Vietnam', 'Bhutan', 'Marshall Islands', 'Kiribati', 'Tonga',
       'Kosovo', 'South Sudan', 'Lesotho'], dtype=object)

In [ ]:
df.isnull().sum()

ID             0
Name           0
Sex            0
Age         4954
Height     28152
Weight     29379
Team           0
NOC            0
Games          0
Year           0
Season         0
City           0
Sport          0
Event          0
Medal     100292
region       148
notes     115847
dtype: int64

In [ ]:
df.duplicated().sum()

6339

In [ ]:
# Drop duplicate data
df.drop_duplicates(inplace=True)

In [ ]:
df['Medal'].value_counts()

Gold      5715
Bronze    5669
Silver    5610
Name: Medal, dtype: int64

In [ ]:
df = pd.concat([df, pd.get_dummies(df['Medal'])], axis=1)

In [ ]:
df.shape

(111791, 20)

In [ ]:
df.groupby('NOC').sum()[['Gold', 'Silver', 'Bronze']].sort_values('Gold', ascending=False).reset_index().head()

   NOC    Gold  Silver  Bronze
0  USA  1280.0   719.0   619.0
1  URS   381.0   292.0   294.0
2  GBR   338.0   394.0   317.0
3  FRA   299.0   343.0   355.0
4  GER   281.0   280.0   323.0

In [ ]:
df[(df['NOC'] == 'INA') & (df['Medal'] == 'Gold')]

          ID                                Name Sex  ...  Bronze  Gold Silver
2143    1374                       Tontowi Ahmad   M  ...       0     1      0
26122  16152  Alexander Alan Budikusuma Wiratama   M  ...       0     1      0
71980  43865                        Tony Gunawan   M  ...       0     1      0
79341  48435                      Taufik Hidayat   M  ...       0     1      0
97096  59576                         Markis Kido   M  ...       0     1      0

[5 rows x 20 columns]

In [ ]:
medal_tally = df.drop_duplicates(subset=['Team', 'NOC', 'Games', 'Year', 'City', 'Sport', 'Event', 'Medal'])

In [ ]:
medal_tally = medal_tally.groupby('NOC').sum()[['Gold', 'Silver', 'Bronze']].sort_values('Gold', ascending=False).reset_index()

In [ ]:
medal_tally[medal_tally['NOC'] == 'INA']

    NOC  Gold  Silver  Bronze
48  INA   5.0     6.0     6.0

In [ ]:
medal_tally['Total'] = medal_tally['Gold'] + medal_tally['Silver'] + medal_tally['Bronze']

In [ ]:
medal_tally['Total']

0      1552.0
1       574.0
2       612.0
3       539.0
4       498.0
        ...
225       0.0
226       8.0
227       1.0
228       0.0
229       0.0
Name: Total, Length: 230, dtype: float64

In [ ]:
years = df['Year'].unique().tolist()

In [ ]:
years.sort()

In [ ]:
years

In [ ]:
years.insert(0, 'Overall')

In [ ]:
years

In [ ]:
country = df['region'].unique().tolist()

In [ ]:
country = np.unique(df['region'].dropna().values).tolist()

In [ ]:
country.sort()

In [ ]:
country

In [ ]:
country.insert(0, 'Overall')

In [ ]:
country

In [ ]:
def fetch_medal_tally(year, country):
  medal_df = df.drop_duplicates(subset=['Team', 'NOC', 'Games', 'Year', 'City', 'Sport', 'Event', 'Medal'])
  flag = 0
  if year == 'Overall' and country == 'Overall':
    temp_df = medal_df
  if year == 'Overall' and country != 'Overall':
    flag = 1
    temp_df = medal_df[medal_df['region'] == country]
  if year != 'Overall' and country == 'Overall':
    temp_df = medal_df[medal_df['Year'] == int(year)]
  if year != 'Overall' and country != 'Overall':
    temp_df = medal_df[(medal_df['Year'] == 2016) & (medal_df['region'] == country)]

  if flag == 1:
    x = temp_df.groupby('Year').sum()[['Gold', 'Silver', 'Bronze']].sort_values('Year').reset_index()
  else:
    x = temp_df.groupby('region').sum()[['Gold', 'Silver', 'Bronze']].sort_values('Gold', ascending=False).reset_index()

  x['Total'] = x['Gold'] + x['Silver'] + x['Bronze']

  print(x)

In [ ]:
medal_df = df.drop_duplicates(subset=['Team', 'NOC', 'Games', 'Year', 'City', 'Sport', 'Event', 'Medal'])

In [ ]:
fetch_medal_tally(year=2016, country='Overall')

Empty DataFrame
Columns: [region, Gold, Silver, Bronze, Total]
Index: []

In [ ]:
medal_df[medal_df['region'] == 'Indonesia']

           ID                      Name Sex   Age  ...  notes Bronze Gold Silver
472       310     Patmawati Abdul Wahid   F  32.0  ...    NaN      0    0      0
1600     1019    Selvyana Adrian-Sofyan   F  33.0  ...    NaN      0    0      0
1601     1019    Selvyana Adrian-Sofyan   F  37.0  ...    NaN      0    0      0
1602     1019    Selvyana Adrian-Sofyan   F  37.0  ...    NaN      0    0      0
2031     1301     Sri Wahyuni Agustiani   F  21.0  ...    NaN      0    0      1
...       ...                       ...  ..   ...  ...    ...    ...  ...    ...
107402  65923            Ilham B. Lahia   M  20.0  ...    NaN      0    0      0
112084  68756  Handry Octavianus Lenzun   M  20.0  ...    NaN      0    0      0
112528  69013           Warino Lestanto   M  23.0  ...    NaN      0    0      0
112529  69014   Afdiharto Mardi Lestari   M  20.0  ...    NaN      0    0      0
112530  69014   Afdiharto Mardi Lestari   M  20.0  ...    NaN      0    0      0

[128 rows x 20 columns]

In [ ]:
nations_over_time = df.drop_duplicates(['Year', 'region'])['Year'].value_counts().reset_index().sort_values('index')

In [ ]:
nations_over_time.rename(columns={'index':'Edition', 'Year':'No of Countries'}, inplace=True)

In [5]:
import plotly.express as px
import seaborn as sns

In [ ]:
fig = px.line(nations_over_time, x='Edition', y='No of Countries')

In [ ]:
   x = df.drop_duplicates(['Year', 'Sport', 'Event'])

In [ ]:
sns.heatmap(x.pivot_table(index='Sport', columns='Year', 
                           values='Event', aggfunc='count').fillna(0).astype('int'), annot=True)

In [ ]:
df.dropna(subset=['Medal'])['Name'].value_counts().reset_index().merge(df, left_on='index', 
                                                                       right_on='Name', how='left')[['index', 'Name']]

In [ ]:
def most_successful(df, sport):
  temp_df = df.dropna(subset=['Medal'])

  if sport != 'Overall':
    temp_df = temp_df[temp_df['Sport'] == sport]

  x = temp_df['Name'].value_counts().reset_index().head(15).merge(df, left_on='index', 
                                                                     right_on='Name', how='left')[['index', 
                                                                     'Name_x', 'Sport', 'region']].drop_duplicates('index')
  x.rename(columns={'index': 'Name', 'Name_x': 'Medals'}, inplace=True)

  return x

In [ ]:
temp_df = df.dropna(subset=['Medal'])
temp_df.drop_duplicates(subset=['Team', 'NOC', 'Games', 'Year', 'City', 'Sport', 'Event', 'Medal'], inplace=True)
new_df = temp_df[temp_df['region'] == 'USA']
final_df = new_df.groupby('Year').count()['Medal'].reset_index()

In [ ]:
fig = px.line(final_df, x='Year', y='Medal')

In [ ]:
new_df = temp_df[temp_df['region'] == 'USA']
sns.heatmap(new_df.pivot_table(index='Sport', columns='Year', values='Medal', aggfunc='count').fillna(0), annot=True)

In [6]:
import plotly.figure_factory as ff

In [ ]:
athletes_df = df.drop_duplicates(subset=['Name', 'region'])

In [ ]:
x1 = athletes_df['Age'].dropna()
x2 = athletes_df[athletes_df['Medal'] == 'Gold']['Age'].dropna()
x3 = athletes_df[athletes_df['Medal'] == 'Silver']['Age'].dropna()
x4 = athletes_df[athletes_df['Medal'] == 'Bronze']['Age'].dropna()

In [ ]:
ff.create_distplot([x1, x2, x3, x4], ['Age Distribution', 'Gold Medalist', 'Silver Medalist', 'Bronze Medalist'], 
                   show_hist=False, show_rug=False)

In [ ]:
x = []
name = []

for sport in famous_sports:
  temp_df = athletes_df[athletes_df['Sport'] == sport]
  x.append(temp_df[temp_df['Medal'] == 'Gold']['Age'].dropna())
  name.append(sport)